# Connect To DB

In [1]:
%load_ext sql
%sql mysql://no_pass@localhost:3306/HogwartzAccounting?local_infile=1

# Find Student Debt To University

In [2]:
studentid = 41

In [3]:
%%sql
SELECT

(
    -- amount owed by student
    SELECT SUM(COURSE_COST) FROM COURSE WHERE COURSE_ID IN (
        SELECT COURSE_ID FROM STUDENT_COURSE WHERE STUDENT_ID = {studentid}
    )
)
- 
(
    -- amount payed by student to university
    SELECT SUM(AMOUNT) FROM BANK_TRANSFER WHERE PERSON_ID = {studentid} AND OUTGOING = 0
)
+ 
(
    -- amount payed by university to student
    SELECT SUM(AMOUNT) FROM BANK_TRANSFER WHERE PERSON_ID = {studentid} AND OUTGOING = 1
) AS STUDENT_DEBT

 * mysql://no_pass@localhost:3306/HogwartzAccounting?local_infile=1
1 rows affected.

[(None,)]

# Find University Debt To Professor (Professor Credit)

In [4]:
professor_name = '"Quill Annes"'

In [5]:
%%sql
SELECT
prof.PERSON_ID as pid,
(
    -- amount owed by university
    SELECT SUM(crs.PROFESSOR_PAY * prof_crs.WEEKLY_HOURS) 
    FROM COURSE crs 
    JOIN PROFESSOR_COURSE prof_crs 
    ON crs.course_id = prof_crs.course_id
    WHERE prof_crs.PROFESSOR_ID = pid
)
- 
(
    -- amount payed by university to professor
    SELECT SUM(AMOUNT) FROM BANK_TRANSFER WHERE PERSON_ID = pid AND OUTGOING = 1
)
+ 
(
    -- amount payed by professor to university
    SELECT SUM(AMOUNT) FROM BANK_TRANSFER WHERE PERSON_ID = pid AND OUTGOING = 0
) AS PROFESSOR_CREDIT
FROM PERSON per 
JOIN PROFESSOR prof 
ON per.person_id = prof.person_id 
WHERE CONCAT(per.first_name, ' ', per.last_name) = {professor_name}

 * mysql://no_pass@localhost:3306/HogwartzAccounting?local_infile=1
0 rows affected.

[]

# Find Courses Taught By "Old" Professors

In [6]:
old_cutoff = '1991-01-01'

In [7]:
%%sql
SELECT
    c.course_name, 
    CONCAT(per.first_name, ' ', per.last_name) AS professor_name, 
    per.date_of_birth
FROM 
    COURSE c
JOIN 
    PROFESSOR_COURSE pc ON c.course_id = pc.course_id
JOIN 
    PROFESSOR p ON pc.professor_id = p.person_id
JOIN 
    PERSON per ON p.person_id = per.person_id
WHERE 
    per.date_of_birth < "{old_cutoff}";

 * mysql://no_pass@localhost:3306/HogwartzAccounting?local_infile=1
8 rows affected.

[('Wizard Risk Management', 'Steffie Reggiani', datetime.date(1990, 11, 21)),
 ('Wizard Succession Planning', 'Steffie Reggiani', datetime.date(1990, 11, 21)),
 ('Advanced Charms', 'Steffie Reggiani', datetime.date(1990, 11, 21)),
 ('Basic Magical Cuisine', 'Xymenes Sogg', datetime.date(1990, 3, 25)),
 ('Wizard Political Leadership', 'Xymenes Sogg', datetime.date(1990, 3, 25)),
 ('Wizard Physical Leadership', 'Xymenes Sogg', datetime.date(1990, 3, 25)),
 ('Advanced Magical History', 'Vittorio Dommerque', datetime.date(1990, 6, 10)),
 ('Advanced Magical Theory', 'Vittorio Dommerque', datetime.date(1990, 6, 10))]

# Find How Profitable A Specific Course Is

In [8]:
course_name = "Magical Geography"

In [9]:
%%sql
SELECT 
    c.course_name,
    c.course_cost * COUNT(sc.student_id) AS total_course_revenue
FROM 
    COURSE c
JOIN 
    STUDENT_COURSE sc ON c.course_id = sc.course_id
WHERE 
    c.course_name = '{course_name}'
GROUP BY 
    c.course_name, c.course_cost;

 * mysql://no_pass@localhost:3306/HogwartzAccounting?local_infile=1
1 rows affected.

[('Magical Geography', Decimal('234.04'))]